# Brewfile
# This file documents all Homebrew installations and can be used to set up a new machine.
# To use this file for installation, run: brew bundle

# Taps (Third-party repositories)


# Formulae (Command-line packages)
brew "git"
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "direnv"
brew "starship"         # Cross-shell customizable prompt
brew "fzf"              # Command-line fuzzy finder
brew "terminal-notifier" # macOS notification system integration
brew "shellspec"

# Kubernetes and Container Tools
brew "kubectl"          # Kubernetes command-line tool
brew "helm"             # Kubernetes package manager
brew "k9s"              # Terminal UI for Kubernetes
brew "kubectx"          # Kubernetes context switcher
brew "kustomize"        # Kubernetes configuration customization
brew "buildkit"         # Next-generation container image builder
brew "dive"             # Tool for exploring Docker images
brew "ctop"             # Top-like interface for container metrics
brew "htop"             # Enhanced interactive process viewer

# Development Tools
brew "zsh"
brew "antidote"      # Plugin manager for zsh
brew "coreutils"     # GNU core utilities (provides gtimeout for macOS)
brew "jq"            # JSON processing for MCP configurations
brew "yq"            # YAML processing for configurations
brew "gitleaks"      # Secret scanner for Git repositories
brew "trivy"         # Vulnerability scanner for containers and IaC
brew "aider"         # AI-powered coding assistant
brew "block-goose-cli" # Block Goose CLI
brew "gh"             # GitHub CLI
brew "codex"          # Codex CLI


# Casks (GUI applications)
cask "cursor"
cask "iterm2"
cask "raycast"
cask "windsurf"
cask "zed"
cask "warp"
cask "orbstack"         # Fast, light Docker & Linux on macOS with Kubernetes support
cask "claude"           # Anthropic's official Claude AI desktop app
cask "figma@beta"       # Collaborative design tool (beta version)
cask "figma-agent"      # Font installers for Figma desktop app
cask "block-goose"      # Block Goose Desktop App

# Fonts - These Nerd Fonts are required for Starship prompt to display special icons correctly
# These fonts are now available through the main Homebrew cask repository (no special tap needed)
cask "font-fira-code-nerd-font"         # Popular coding font with Nerd Font icons, works well with Starship
cask "font-jetbrains-mono-nerd-font"    # Clean, crisp font with Nerd Font icons, excellent for terminal use

# CI/CD Tools
