# Brewfile
# This file documents all Homebrew installations and can be used to set up a new machine.
# To use this file for installation, run: brew bundle

# Taps (Third-party repositories)

# Formulae (Command-line packages)
brew "git"
brew "zinit"
brew "rbenv"
brew "pyenv"
brew "direnv"
brew "starship"         # Cross-shell customizable prompt
brew "fzf"              # Command-line fuzzy finder

# Kubernetes and Container Tools
brew "kubectl"          # Kubernetes command-line tool
brew "helm"             # Kubernetes package manager
brew "k9s"              # Terminal UI for Kubernetes
brew "kubectx"          # Kubernetes context switcher
brew "kustomize"        # Kubernetes configuration customization
brew "buildkit"         # Next-generation container image builder
brew "dive"             # Tool for exploring Docker images
brew "ctop"             # Top-like interface for container metrics
brew "htop"             # Enhanced interactive process viewer

# Casks (GUI applications)
cask "cursor"
cask "iterm2"
cask "raycast"
cask "windsurf"
cask "zed"
cask "warp"
cask "orbstack"         # Fast, light Docker & Linux on macOS with Kubernetes support

# Fonts - These Nerd Fonts are required for Starship prompt to display special icons correctly
# These fonts are now available through the main Homebrew cask repository (no special tap needed)
cask "font-fira-code-nerd-font"         # Popular coding font with Nerd Font icons, works well with Starship
cask "font-jetbrains-mono-nerd-font"    # Clean, crisp font with Nerd Font icons, excellent for terminal use

